# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
# import libraries here

import pandas as pd

# Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [2]:
# your code here

temp = pd.read_csv('Temp_States.csv')

#### Print `temp`.

In [3]:
# your code here

temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [5]:
# your code here

temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [6]:
"""
We have data about different temperatures by city
"""

'\nWe have data about different temperatures by city\n'

#### Select the rows where state is New York.

In [7]:
# your code here
temp[temp['State']=='New York']

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [8]:
# your code here
temp[temp['State']=='New York'].mean

<bound method NDFrame._add_numeric_operations.<locals>.mean of       City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333>

#### Which states and cities have a temperature above 15 degrees Celsius?

In [9]:
# your code here
temp[temp['Temperature'] > 15]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [10]:
# your code here
temp.loc[temp['Temperature'] > 15, 'City']

0         NYC
3    Hartford
5      Treton
6      Newark
Name: City, dtype: object

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [11]:
# your code here

temp.loc[(temp['Temperature'] > 15) & (temp['Temperature'] < 20) , 'City']

0         NYC
3    Hartford
Name: City, dtype: object

#### Find the mean and standard deviation of the temperature of each state.

In [12]:
# your code here

temp.groupby('State').mean()

             Temperature
State
Connecticut    15.833333
New Jersey     21.111111
New York       10.740741

In [13]:
temp.groupby('State').std()

             Temperature
State
Connecticut     1.964186
New Jersey      1.571348
New York        8.133404

#  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [14]:
# your code here

emp = pd.read_csv('employees.csv')
emp

    Department Education      Title      Name  Years  Salary
0        Admin    Master  associate     David      4      58
1           IT    Master  associate    Thomas      7      45
2        Admin    Master  associate     Diana     10      52
3        Admin    Master         VP  Manuella     15      33
4        Sales    Master    Analyst     Carla      6      38
..         ...       ...        ...       ...    ...     ...
495      Sales       PhD         VP    Calvin      2     119
496         HR    Master    Analyst    Dustin      6      67
497      Sales       PhD         VP   Winston     13      93
498         IT       PhD    Analyst      Earl     12     108
499      Sales    Master    Analyst     Alvin     13      48

[500 rows x 6 columns]

#### Explore the data types of the `employees` dataframe. Comment your results.

In [15]:
# your code here
emp.dtypes

Department    object
Education     object
Title         object
Name          object
Years          int64
Salary         int64
dtype: object

In [16]:
"""
It gives information about employees in each department
"""

'\nIt gives information about employees in each department\n'

#### What's the average salary in this company?

In [17]:
# your code here
mean=emp['Salary'].mean()
mean

73.528

#### What's the highest salary?

In [30]:
# your code here
max=emp['Salary'].max()
max

120

#### What's the lowest salary?

In [19]:
# your code here
min=emp['Salary'].min()
min

30

#### Who are the employees with the lowest salary?

In [20]:
# your code here
emp[emp['Salary']==min]

    Department Education      Title      Name  Years  Salary
27          IT  Bachelor    Analyst      Sean     12      30
106      Admin  Bachelor  associate      Luke      4      30
128      Sales       PhD         VP      Adam      8      30
139      Sales       PhD    Analyst      Rick     11      30
214      Sales    Master         VP      Neil     11      30
266         HR       PhD  associate    Marcel     10      30
452         IT  Bachelor    Analyst  Augustin     13      30

In [29]:
emp[emp['Salary']>55]['Name']

0        David
5        Corey
9       Kareem
10     Cynthia
11      Lester
        ...
494    Vanessa
495     Calvin
496     Dustin
497    Winston
498       Earl
Name: Name, Length: 341, dtype: object

#### Find all the information about an employee called David.

In [22]:
# your code here
emp[emp['Name']=='David']

    Department Education      Title   Name  Years  Salary
0        Admin    Master  associate  David      4      58
124         IT  Bachelor         VP  David      3      31

#### Could you return only David's salary?

In [23]:
# your code here
emp[emp['Name']=='David']['Salary']

0      58
124    31
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [25]:
# your code here
emp[emp['Title']=='associate']

    Department Education      Title      Name  Years  Salary
0        Admin    Master  associate     David      4      58
1           IT    Master  associate    Thomas      7      45
2        Admin    Master  associate     Diana     10      52
7           HR    Master  associate     Carol     14      53
8        Admin       PhD  associate      Jean      8      50
..         ...       ...        ...       ...    ...     ...
477         HR       PhD  associate   Phillip     11     113
486         IT  Bachelor  associate       Jay     14      58
487         HR    Master  associate  Patricia     10     110
491      Admin       PhD  associate     Alice      8      37
494      Sales  Bachelor  associate   Vanessa     11     118

[158 rows x 6 columns]

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [68]:
# Method 1
# your code here

emp.head(3)

  Department Education      Title    Name  Years  Salary
0      Admin    Master  associate   David      4      58
1         IT    Master  associate  Thomas      7      45
2      Admin    Master  associate   Diana     10      52

In [34]:
# Method 2
# your code here

#### Find the employees whose title is associate and whose salary is above 55.

In [32]:
# your code here

#Metod 1
emp.loc[emp['Salary'] > 55, 'Name']

0        David
5        Corey
9       Kareem
10     Cynthia
11      Lester
        ...
494    Vanessa
495     Calvin
496     Dustin
497    Winston
498       Earl
Name: Name, Length: 341, dtype: object

In [35]:
# Metod 2
emp[emp['Salary']>55]['Name']

0        David
5        Corey
9       Kareem
10     Cynthia
11      Lester
        ...
494    Vanessa
495     Calvin
496     Dustin
497    Winston
498       Earl
Name: Name, Length: 341, dtype: object

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [36]:
# your code here
emp.groupby('Years').mean()

          Salary
Years
1      75.863636
2      75.857143
3      74.571429
4      77.129032
5      73.857143
6      72.382353
7      73.840000
8      64.250000
9      76.741935
10     73.351351
11     74.866667
12     73.454545
13     71.935484
14     70.968750
15     69.758621

####  What is the average salary per title?

In [37]:
# your code here
emp.groupby('Title').mean()

              Years     Salary
Title
Analyst    7.849162  73.703911
VP         7.619632  72.907975
associate  7.158228  73.968354

####  Find the salary quartiles.

In [41]:
# your code here
emp.pivot_table(index=["Title"], values=["Salary"], aggfunc={'Salary': 'describe'})

          Salary
             25%   50%   75%  count    max       mean   min        std
Title
Analyst    49.00  71.0  99.0  179.0  120.0  73.703911  30.0  27.028835
VP         52.00  72.0  94.0  163.0  120.0  72.907975  30.0  25.996631
associate  48.25  73.0  97.0  158.0  120.0  73.968354  30.0  27.783609

#### Is the mean salary different per gender?

In [ ]:
# your code here

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [39]:
# your code here
emp.pivot_table(index=["Department"], values=["Years","Salary"], aggfunc={'Salary': 'describe','Years': 'describe'})

           Salary                                                         \
              25%   50%    75%  count    max       mean   min        std
Department
Admin       53.50  78.0  98.00  123.0  120.0  76.325203  30.0  25.734615
HR          50.25  74.5  96.00  122.0  119.0  74.237705  30.0  26.522423
IT          46.25  69.0  97.75  134.0  120.0  70.671642  30.0  27.406101
Sales       49.00  69.0  95.00  121.0  120.0  73.132231  30.0  27.819340

           Years
             25%  50%   75%  count   max      mean  min       std
Department
Admin       3.00  8.0  12.0  123.0  15.0  7.642276  1.0  4.706344
HR          3.25  6.0  11.0  122.0  15.0  7.172131  1.0  4.292397
IT          4.00  8.5  12.0  134.0  15.0  8.141791  1.0  4.472393
Sales       3.00  7.0  11.0  121.0  15.0  7.206612  1.0  4.358741

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [ ]:
# your code here

# Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [ ]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [ ]:
# your code here

#### What are the highest and lowest purchase prices?

In [ ]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [ ]:
# your code here

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here